tap "felixkratz/formulae"
tap "nikitabobko/tap"
tap "oven-sh/bun"
brew "azure-cli"
brew "docker"
brew "docker-compose"
brew "fzf"
brew "gemini-cli"
brew "gh"
brew "lazygit", link: false
brew "neovim"
brew "node@22"
brew "nvm"
brew "pnpm"
brew "ripgrep"
brew "starship"
brew "tmux"
brew "tree"
brew "typescript"
brew "yarn"
brew "felixkratz/formulae/sketchybar"
brew "oven-sh/bun/bun"
cask "aerospace"
cask "ghostty"
cask "keycastr"
cask "libreoffice"
cask "lookaway"
cask "only-switch"
cask "shottr"
vscode "aaron-bond.better-comments"
vscode "astro-build.astro-vscode"
vscode "bracketpaircolordlw.bracket-pair-color-dlw"
vscode "bradlc.vscode-tailwindcss"
vscode "catppuccin.catppuccin-vsc"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "coder-yolo.gitdashboard"
vscode "davidanson.vscode-markdownlint"
vscode "davidbwaters.macos-modern-theme"
vscode "dbaeumer.vscode-eslint"
vscode "docker.docker"
vscode "dsznajder.es7-react-js-snippets"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "enkia.tokyo-night"
vscode "esbenp.prettier-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "github.vscode-pull-request-github"
vscode "google.geminicodeassist"
vscode "gruntfuggly.todo-tree"
vscode "helixquar.randomeverything"
vscode "johnpapa.vscode-cloak"
vscode "johnpapa.vscode-peacock"
vscode "mechatroner.rainbow-csv"
vscode "miguelsolorio.symbols"
vscode "mikestead.dotenv"
vscode "ms-azure-load-testing.microsoft-testing"
vscode "ms-azuretools.azure-dev"
vscode "ms-azuretools.vscode-azure-github-copilot"
vscode "ms-azuretools.vscode-azure-mcp-server"
vscode "ms-azuretools.vscode-azureappservice"
vscode "ms-azuretools.vscode-azurecontainerapps"
vscode "ms-azuretools.vscode-azurefunctions"
vscode "ms-azuretools.vscode-azureresourcegroups"
vscode "ms-azuretools.vscode-azurestaticwebapps"
vscode "ms-azuretools.vscode-azurestorage"
vscode "ms-azuretools.vscode-azurevirtualmachines"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-cosmosdb"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.vscode-node-azure-pack"
vscode "ms-vsliveshare.vsliveshare"
vscode "ms-windows-ai-studio.windows-ai-studio"
vscode "msazurermtools.azurerm-vscode-tools"
vscode "murloccra4ler.leap"
vscode "mylesmurphy.prettify-ts"
vscode "naumovs.color-highlight"
vscode "openai.chatgpt"
vscode "orta.vscode-jest"
vscode "pkief.material-icon-theme"
vscode "repreng.csv"
vscode "ritwickdey.liveserver"
vscode "rodrigovallades.es7-react-js-snippets"
vscode "sdras.night-owl"
vscode "selvinortiz.twig-for-craft-2"
vscode "streetsidesoftware.code-spell-checker"
vscode "tamasfe.even-better-toml"
vscode "teamsdevapp.vscode-ai-foundry"
vscode "tonybaloney.vscode-pets"
vscode "usernamehw.errorlens"
vscode "vinliao.fast-arrow"
vscode "vscode-icons-team.vscode-icons"
vscode "vscodevim.vim"
vscode "vspacecode.whichkey"
vscode "vue.volar"
vscode "wallabyjs.wallaby-vscode"
vscode "yamato-ltd.vscode-aem-sync"
vscode "yzhang.markdown-all-in-one"
